RealtimeEngineering/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/smartcom/cc1352r1/CC1352R1_SMARTCOM.c
/*
 *  =============================== I2S ===============================
*/
#include <ti/drivers/I2S.h>
#include <ti/drivers/i2s/I2SCC26XX.h>

I2SCC26XX_Object i2sCC26XXObjects[CC1352R1_SMARTCOM_I2SCOUNT];

const I2SCC26XX_HWAttrs i2sCC26XXHWAttrs[CC1352R1_SMARTCOM_I2SCOUNT] = {
    {
        .pinSD1      =  CC1352R1_SMARTCOM_I2S_ADI,
        .pinSD0      =  CC1352R1_SMARTCOM_I2S_ADO,
        .pinSCK      =  CC1352R1_SMARTCOM_I2S_BCLK,
        .pinMCLK     =  CC1352R1_SMARTCOM_I2S_MCLK,
        .pinWS       =  CC1352R1_SMARTCOM_I2S_WCLK,
        .intPriority = ~0,
    }
};

const I2S_Config I2S_config[CC1352R1_SMARTCOM_I2SCOUNT] = {
    {
        .object      = &i2sCC26XXObjects[CC1352R1_SMARTCOM_I2S0],
        .hwAttrs     = &i2sCC26XXHWAttrs[CC1352R1_SMARTCOM_I2S0]
    },
};

const uint_least8_t I2S_count = CC1352R1_SMARTCOM_I2SCOUNT;

/*
 *  =============================== NVS ===============================
 */
#include <ti/drivers/NVS.h>
#include <ti/drivers/nvs/NVSSPI25X.h>
#include <ti/drivers/nvs/NVSCC26XX.h>

#define NVS_REGIONS_BASE 0x48000
#define SECTORSIZE       0x2000
#define REGIONSIZE       (SECTORSIZE * 4)

#if TI_NVS_CONF_ENABLE

#if TI_NVS_CONF_NVS_INTERNAL_ENABLE

/*
 * Reserve flash sectors for NVS driver use by placing an uninitialized byte
 * array at the desired flash address.
 */
#if defined(__TI_COMPILER_VERSION__)

/*
 * Place uninitialized array at NVS_REGIONS_BASE
 */
#pragma LOCATION(flashBuf, NVS_REGIONS_BASE);
#pragma NOINIT(flashBuf);
static char flashBuf[REGIONSIZE];

#elif defined(__IAR_SYSTEMS_ICC__)

/*
 * Place uninitialized array at NVS_REGIONS_BASE
 */
static __no_init char flashBuf[REGIONSIZE] @ NVS_REGIONS_BASE;

#elif defined(__GNUC__)

/*
 * Place the flash buffers in the .nvs section created in the gcc linker file.
 * The .nvs section enforces alignment on a sector boundary but may
 * be placed anywhere in flash memory.  If desired the .nvs section can be set
 * to a fixed address by changing the following in the gcc linker file:
 *
 * .nvs (FIXED_FLASH_ADDR) (NOLOAD) : AT (FIXED_FLASH_ADDR) {
 *      *(.nvs)
 * } > REGION_TEXT
 */
__attribute__ ((section (".nvs")))
static char flashBuf[REGIONSIZE];

#endif

/* Allocate objects for NVS Internal Regions */
NVSCC26XX_Object nvsCC26xxObjects[1];

/* Hardware attributes for NVS Internal Regions */
const NVSCC26XX_HWAttrs nvsCC26xxHWAttrs[1] = {
    {
        .regionBase = (void *)flashBuf,
        .regionSize = REGIONSIZE,
    },
};

#endif /* TI_NVS_CONF_NVS_INTERNAL_ENABLE */

#if TI_NVS_CONF_NVS_EXTERNAL_ENABLE

#define SPISECTORSIZE    0x1000
#define SPIREGIONSIZE    (SPISECTORSIZE * 32)
#define VERIFYBUFSIZE    64

static uint8_t verifyBuf[VERIFYBUFSIZE];

/* Allocate objects for NVS External Regions */
NVSSPI25X_Object nvsSPI25XObjects[1];

/* Hardware attributes for NVS External Regions */
const NVSSPI25X_HWAttrs nvsSPI25XHWAttrs[1] = {
    {
        .regionBaseOffset = 0,
        .regionSize = SPIREGIONSIZE,
        .sectorSize = SPISECTORSIZE,
        .verifyBuf = verifyBuf,
        .verifyBufSize = VERIFYBUFSIZE,
        .spiHandle = NULL,
        .spiIndex = 0,
        .spiBitRate = 4000000,
        .spiCsnGpioIndex = CC1352R1_SMARTCOM_GPIO_SPI_FLASH_CS,
        .statusPollDelayUs = 100,
    },
};

#endif /* TI_NVS_CONF_NVS_EXTERNAL_ENABLE */

/* NVS Region index 0 and 1 refer to NVS and NVS SPI respectively */
const NVS_Config NVS_config[CC1352R1_SMARTCOM_NVSCOUNT] = {
#if TI_NVS_CONF_NVS_INTERNAL_ENABLE
    {
        .fxnTablePtr = &NVSCC26XX_fxnTable,
        .object = &nvsCC26xxObjects[0],
        .hwAttrs = &nvsCC26xxHWAttrs[0],
    },
#endif
#if TI_NVS_CONF_NVS_EXTERNAL_ENABLE
    {
        .fxnTablePtr = &NVSSPI25X_fxnTable,
        .object = &nvsSPI25XObjects[0],
        .hwAttrs = &nvsSPI25XHWAttrs[0],
    },
#endif
};

const uint_least8_t NVS_count = CC1352R1_SMARTCOM_NVSCOUNT;

#endif /* TI_NVS_CONF_ENABLE */

/*
 *  =============================== PIN ===============================
 */
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>

const PIN_Config BoardGpioInitTable[] = {
    CC1352R1_SMARTCOM_UART0_RX | PIN_INPUT_EN | PIN_PULLUP,                                                /* UART RX via debugger back channel */
    CC1352R1_SMARTCOM_UART0_TX | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,                        /* UART TX via debugger back channel */
    CC1352R1_SMARTCOM_UART1_RX | PIN_INPUT_EN | PIN_PULLUP,                                                /* UART RX via debugger back channel */
    CC1352R1_SMARTCOM_UART1_TX | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,                        /* UART TX via debugger back channel */
    PIN_TERMINATE
};

const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26X2.h>
#include "clock-arch.h"

const PowerCC26X2_Config PowerCC26X2_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &clock_arch_standby_policy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = true,
    .calibrateRCOSC_LF  = true,
    .calibrateRCOSC_HF  = true,
};

/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[CC1352R1_SMARTCOM_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[CC1352R1_SMARTCOM_PWMCOUNT] = {
    { .pwmPin = CC1352R1_SMARTCOM_PWMPIN0, .gpTimerUnit = CC1352R1_SMARTCOM_GPTIMER0A },
    { .pwmPin = CC1352R1_SMARTCOM_PWMPIN1, .gpTimerUnit = CC1352R1_SMARTCOM_GPTIMER0B },
    { .pwmPin = CC1352R1_SMARTCOM_PWMPIN2, .gpTimerUnit = CC1352R1_SMARTCOM_GPTIMER1A },
    { .pwmPin = CC1352R1_SMARTCOM_PWMPIN3, .gpTimerUnit = CC1352R1_SMARTCOM_GPTIMER1B },
    { .pwmPin = CC1352R1_SMARTCOM_PWMPIN4, .gpTimerUnit = CC1352R1_SMARTCOM_GPTIMER2A },
    { .pwmPin = CC1352R1_SMARTCOM_PWMPIN5, .gpTimerUnit = CC1352R1_SMARTCOM_GPTIMER2B },
    { .pwmPin = CC1352R1_SMARTCOM_PWMPIN6, .gpTimerUnit = CC1352R1_SMARTCOM_GPTIMER3A },
    { .pwmPin = CC1352R1_SMARTCOM_PWMPIN7, .gpTimerUnit = CC1352R1_SMARTCOM_GPTIMER3B },
};

