RealtimeEngineering/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/smartcom/cc1352r1/CC1352R1_SMARTCOM.c
const PWM_Config PWM_config[CC1352R1_SMARTCOM_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352R1_SMARTCOM_PWM0], &pwmtimerCC26xxHWAttrs[CC1352R1_SMARTCOM_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352R1_SMARTCOM_PWM1], &pwmtimerCC26xxHWAttrs[CC1352R1_SMARTCOM_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352R1_SMARTCOM_PWM2], &pwmtimerCC26xxHWAttrs[CC1352R1_SMARTCOM_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352R1_SMARTCOM_PWM3], &pwmtimerCC26xxHWAttrs[CC1352R1_SMARTCOM_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352R1_SMARTCOM_PWM4], &pwmtimerCC26xxHWAttrs[CC1352R1_SMARTCOM_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352R1_SMARTCOM_PWM5], &pwmtimerCC26xxHWAttrs[CC1352R1_SMARTCOM_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352R1_SMARTCOM_PWM6], &pwmtimerCC26xxHWAttrs[CC1352R1_SMARTCOM_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352R1_SMARTCOM_PWM7], &pwmtimerCC26xxHWAttrs[CC1352R1_SMARTCOM_PWM7] },
};

const uint_least8_t PWM_count = CC1352R1_SMARTCOM_PWMCOUNT;

/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

const RFCC26XX_HWAttrsV2 RFCC26XX_hwAttrs = {
    .hwiPriority        = ~0,     /* Lowest HWI priority */
    .swiPriority        = 0,      /* Lowest SWI priority */
    .xoscHfAlwaysNeeded = true,   /* Keep XOSC dependency while in standby */
    .globalCallback     = NULL,   /* No board specific callback */
    .globalEventMask    = 0       /* No events subscribed to */
};

/*
 *  =============================== SD ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/sd/SDSPI.h>

#if TI_SD_CONF_ENABLE

#if !(TI_SPI_CONF_SPI0_ENABLE)
#error "SD driver requires SPI0 enabled"
#endif

SDSPI_Object sdspiObjects[CC1352R1_SMARTCOM_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[CC1352R1_SMARTCOM_SDCOUNT] = {
    {
        .spiIndex = CC1352R1_SMARTCOM_SPI0,
        .spiCsGpioIndex = CC1352R1_SMARTCOM_SDSPI_CS
    }
};

const SD_Config SD_config[CC1352R1_SMARTCOM_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[CC1352R1_SMARTCOM_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[CC1352R1_SMARTCOM_SDSPI0]
    },
};

const uint_least8_t SD_count = CC1352R1_SMARTCOM_SDCOUNT;

#endif /* TI_SD_CONF_ENABLE */

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26X2DMA.h>

#if TI_SPI_CONF_ENABLE

SPICC26X2DMA_Object spiCC26X2DMAObjects[CC1352R1_SMARTCOM_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPICC26X2DMA_HWAttrs spiCC26X2DMAHWAttrs[CC1352R1_SMARTCOM_SPICOUNT] = {
#if TI_SPI_CONF_SPI0_ENABLE
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC1352R1_SMARTCOM_SPI0_MOSI,
        .misoPin            = CC1352R1_SMARTCOM_SPI0_MISO,
        .clkPin             = CC1352R1_SMARTCOM_SPI0_CLK,
        .csnPin             = CC1352R1_SMARTCOM_SPI0_CSN,
        .minDmaTransferSize = 10
    },
#endif
#if TI_SPI_CONF_SPI1_ENABLE
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC1352R1_SMARTCOM_SPI1_MOSI,
        .misoPin            = CC1352R1_SMARTCOM_SPI1_MISO,
        .clkPin             = CC1352R1_SMARTCOM_SPI1_CLK,
        .csnPin             = CC1352R1_SMARTCOM_SPI1_CSN,
        .minDmaTransferSize = 10
    },
#endif
};

const SPI_Config SPI_config[CC1352R1_SMARTCOM_SPICOUNT] = {
#if TI_SPI_CONF_SPI0_ENABLE
    {
         .fxnTablePtr = &SPICC26X2DMA_fxnTable,
         .object      = &spiCC26X2DMAObjects[CC1352R1_SMARTCOM_SPI0],
         .hwAttrs     = &spiCC26X2DMAHWAttrs[CC1352R1_SMARTCOM_SPI0]
    },
#endif
#if TI_SPI_CONF_SPI1_ENABLE
    {
         .fxnTablePtr = &SPICC26X2DMA_fxnTable,
         .object      = &spiCC26X2DMAObjects[CC1352R1_SMARTCOM_SPI1],
         .hwAttrs     = &spiCC26X2DMAHWAttrs[CC1352R1_SMARTCOM_SPI1]
    },
#endif
};

const uint_least8_t SPI_count = CC1352R1_SMARTCOM_SPICOUNT;

#endif /* TI_SPI_CONF_ENABLE */

/*
 *  =============================== UART ===============================
 */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26XX.h>

#if TI_UART_CONF_ENABLE

UARTCC26XX_Object uartCC26XXObjects[CC1352R1_SMARTCOM_UARTCOUNT];

uint8_t uartCC26XXRingBuffer[CC1352R1_SMARTCOM_UARTCOUNT][32];

const UARTCC26XX_HWAttrsV2 uartCC26XXHWAttrs[CC1352R1_SMARTCOM_UARTCOUNT] = {
#if TI_UART_CONF_UART0_ENABLE
    {
        .baseAddr       = UART0_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_UART0,
        .intNum         = INT_UART0_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = CC1352R1_SMARTCOM_UART0_TX,
        .rxPin          = CC1352R1_SMARTCOM_UART0_RX,
        .ctsPin         = PIN_UNASSIGNED,
        .rtsPin         = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[CC1352R1_SMARTCOM_UART0],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[CC1352R1_SMARTCOM_UART0]),
        .txIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_1_8,
        .rxIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_4_8,
        .errorFxn       = NULL
    },
#endif
#if TI_UART_CONF_UART1_ENABLE
    {
        .baseAddr       = UART1_BASE,
        .powerMngrId    = PowerCC26X2_PERIPH_UART1,
        .intNum         = INT_UART1_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = CC1352R1_SMARTCOM_UART1_TX,
        .rxPin          = CC1352R1_SMARTCOM_UART1_RX,
        .ctsPin         = PIN_UNASSIGNED,
        .rtsPin         = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[CC1352R1_SMARTCOM_UART1],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[CC1352R1_SMARTCOM_UART1]),
        .txIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_1_8,
        .rxIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_4_8,
        .errorFxn       = NULL
    },
#endif
};

const UART_Config UART_config[CC1352R1_SMARTCOM_UARTCOUNT] = {
#if TI_UART_CONF_UART0_ENABLE
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[CC1352R1_SMARTCOM_UART0],
        .hwAttrs     = &uartCC26XXHWAttrs[CC1352R1_SMARTCOM_UART0]
    },
#endif
#if TI_UART_CONF_UART1_ENABLE
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[CC1352R1_SMARTCOM_UART1],
        .hwAttrs     = &uartCC26XXHWAttrs[CC1352R1_SMARTCOM_UART1]
    },
#endif
};

const uint_least8_t UART_count = CC1352R1_SMARTCOM_UARTCOUNT;

#endif /* TI_UART_CONF_ENABLE */

